[Killed] BlockStatement
utils/session.ts:10:49
   createdAt: string;
 }
 
-export function getSession(): UserRecord | null {
-  const data = localStorage.getItem("fg_session");
-  return data ? JSON.parse(data) : null;
-}
+export function getSession(): UserRecord | null {}
 
 export function saveSession(user: UserRecord): void {
killedBy: getSession retorna null si no hay sesión
statusReason: expected undefined to be null

[Killed] BlockStatement
utils/session.ts:15:53
   return data ? JSON.parse(data) : null;
 }
 
-export function saveSession(user: UserRecord): void {
-  localStorage.setItem("fg_session", JSON.stringify(user));
-}
+export function saveSession(user: UserRecord): void {}
 
 export function clearSession(): void {
killedBy: saveSession guarda el usuario en localStorage
statusReason: expected null to deeply equal { id: 1, firstName: 'Juan', …(4) }

[Killed] StringLiteral
utils/session.ts:16:24
 }
 
 export function saveSession(user: UserRecord): void {
-  localStorage.setItem("fg_session", JSON.stringify(user));
+  localStorage.setItem("", JSON.stringify(user));
 }
 
killedBy: saveSession guarda el usuario en localStorage
statusReason: expected null to deeply equal { id: 1, firstName: 'Juan', …(4) }

[Killed] BlockStatement
utils/session.ts:19:38
   localStorage.setItem("fg_session", JSON.stringify(user));
 }
 
-export function clearSession(): void {
-  localStorage.removeItem("fg_session");
-}
+export function clearSession(): void {}
 
 export function getUsers(): UserRecord[] {
killedBy: clearSession elimina la sesión de localStorage
statusReason: expected '{"id":1,"firstName":"Juan","lastName"…' to be null

[Killed] BlockStatement
utils/session.ts:23:42
   localStorage.removeItem("fg_session");
 }
 
-export function getUsers(): UserRecord[] {
-  return JSON.parse(localStorage.getItem("fg_users") || "[]");
-}
+export function getUsers(): UserRecord[] {}
 
 export function saveUsers(users: UserRecord[]): void {
killedBy: getUsers retorna array vacío si no hay usuarios
statusReason: expected undefined to deeply equal []

[Killed] ConditionalExpression
utils/session.ts:24:21
 }
 
 export function getUsers(): UserRecord[] {
-  return JSON.parse(localStorage.getItem("fg_users") || "[]");
+  return JSON.parse(false);
 }
 
killedBy: getUsers retorna array vacío si no hay usuarios
statusReason: expected false to deeply equal []

[Killed] LogicalOperator
utils/session.ts:24:21
 }
 
 export function getUsers(): UserRecord[] {
-  return JSON.parse(localStorage.getItem("fg_users") || "[]");
+  return JSON.parse(localStorage.getItem("fg_users") && "[]");
 }
 
killedBy: getUsers retorna array vacío si no hay usuarios
statusReason: expected null to deeply equal []

[Killed] BlockStatement
utils/session.ts:27:54
   return JSON.parse(localStorage.getItem("fg_users") || "[]");
 }
 
-export function saveUsers(users: UserRecord[]): void {
-  localStorage.setItem("fg_users", JSON.stringify(users));
-}   
+export function saveUsers(users: UserRecord[]): void {}   
killedBy: saveUsers guarda el array de usuarios en localStorage
statusReason: expected null to deeply equal [ { id: 1, firstName: 'Juan', …(4) } ]
