[Killed] BlockStatement
utils/validators.ts:16:62
   password: string;
 }
 
-export function validateRegister(form: RegisterData): string {
-  if (
-  !form.firstName ||
-  !form.lastName ||
-  !form.email ||
-  !form.password ||
-  !form.confirm
-) {
-  return "Fill in all required fields.";
-}
-
-  if (!/^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}$/.test(form.email)) {
-    return "Invalid email address.";
-  }
-  if (form.password.length < 6) {
-    return "Password must be at least 6 characters.";
-  }
-  if (form.password !== form.confirm) {
-    return "Passwords do not match.";
-  }
-  if (!form.terms) {
-    return "You must accept the terms.";
-  }
-  return "";
-}
+export function validateRegister(form: RegisterData): string {}
 
 export function validateLogin(form: LoginData): string {
killedBy: validateRegister retorna error si firstName está vacío
statusReason: expected undefined to be 'Fill in all required fields.' // Object.is equality

[Killed] LogicalOperator
utils/validators.ts:18:3
 
 export function validateRegister(form: RegisterData): string {
   if (
-  !form.firstName ||
-  !form.lastName ||
-  !form.email ||
-  !form.password ||
-  !form.confirm
+  (!form.firstName || !form.lastName || !form.email || !form.password) && !form.confirm
 ) {
   return "Fill in all required fields.";
killedBy: validateRegister retorna error si firstName está vacío
statusReason: expected '' to be 'Fill in all required fields.' // Object.is equality

[Killed] LogicalOperator
utils/validators.ts:18:3
 
 export function validateRegister(form: RegisterData): string {
   if (
-  !form.firstName ||
-  !form.lastName ||
-  !form.email ||
+  (!form.firstName || !form.lastName) && !form.email ||
   !form.password ||
   !form.confirm
killedBy: validateRegister retorna error si firstName está vacío
statusReason: expected '' to be 'Fill in all required fields.' // Object.is equality

[Killed] BooleanLiteral
utils/validators.ts:19:3
 export function validateRegister(form: RegisterData): string {
   if (
   !form.firstName ||
-  !form.lastName ||
+  form.lastName ||
   !form.email ||
   !form.password ||
killedBy: validateRegister retorna error si email es inválido
statusReason: expected 'Fill in all required fields.' to be 'Invalid email address.' // Object.is equality

[Killed] BooleanLiteral
utils/validators.ts:20:3
   if (
   !form.firstName ||
   !form.lastName ||
-  !form.email ||
+  form.email ||
   !form.password ||
   !form.confirm
killedBy: validateRegister retorna error si email está vacío
statusReason: expected 'Invalid email address.' to be 'Fill in all required fields.' // Object.is equality

[Killed] BooleanLiteral
utils/validators.ts:21:3
   !form.firstName ||
   !form.lastName ||
   !form.email ||
-  !form.password ||
+  form.password ||
   !form.confirm
 ) {
killedBy: validateRegister retorna error si email es inválido
statusReason: expected 'Fill in all required fields.' to be 'Invalid email address.' // Object.is equality

[Killed] BooleanLiteral
utils/validators.ts:22:3
   !form.lastName ||
   !form.email ||
   !form.password ||
-  !form.confirm
+  form.confirm
 ) {
   return "Fill in all required fields.";
killedBy: validateRegister retorna error si email es inválido
statusReason: expected 'Fill in all required fields.' to be 'Invalid email address.' // Object.is equality

[Killed] BlockStatement
utils/validators.ts:23:3
   !form.email ||
   !form.password ||
   !form.confirm
-) {
-  return "Fill in all required fields.";
-}
+) {}
 
   if (!/^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}$/.test(form.email)) {
killedBy: validateRegister retorna error si firstName está vacío
statusReason: expected '' to be 'Fill in all required fields.' // Object.is equality

[Killed] ConditionalExpression
utils/validators.ts:27:7
   return "Fill in all required fields.";
 }
 
-  if (!/^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}$/.test(form.email)) {
+  if (true) {
     return "Invalid email address.";
   }
killedBy: validateRegister retorna error si password tiene menos de 6 caracteres
statusReason: expected 'Invalid email address.' to be 'Password must be at least 6 character…' // Object.is equality

[Killed] ConditionalExpression
utils/validators.ts:27:7
   return "Fill in all required fields.";
 }
 
-  if (!/^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}$/.test(form.email)) {
+  if (false) {
     return "Invalid email address.";
   }
killedBy: validateRegister retorna error si email es inválido
statusReason: expected '' to be 'Invalid email address.' // Object.is equality

[Killed] StringLiteral
utils/validators.ts:28:12
 }
 
   if (!/^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}$/.test(form.email)) {
-    return "Invalid email address.";
+    return "";
   }
   if (form.password.length < 6) {
killedBy: validateRegister retorna error si email es inválido
statusReason: expected '' to be 'Invalid email address.' // Object.is equality

[Killed] EqualityOperator
utils/validators.ts:30:7
   if (!/^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}$/.test(form.email)) {
     return "Invalid email address.";
   }
-  if (form.password.length < 6) {
+  if (form.password.length >= 6) {
     return "Password must be at least 6 characters.";
   }
killedBy: validateRegister retorna error si password tiene menos de 6 caracteres
statusReason: expected '' to be 'Password must be at least 6 character…' // Object.is equality

[Killed] BlockStatement
utils/validators.ts:30:33
   if (!/^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}$/.test(form.email)) {
     return "Invalid email address.";
   }
-  if (form.password.length < 6) {
-    return "Password must be at least 6 characters.";
-  }
+  if (form.password.length < 6) {}
   if (form.password !== form.confirm) {
     return "Passwords do not match.";
killedBy: validateRegister retorna error si password tiene menos de 6 caracteres
statusReason: expected '' to be 'Password must be at least 6 character…' // Object.is equality

[Killed] ConditionalExpression
utils/validators.ts:33:7
   if (form.password.length < 6) {
     return "Password must be at least 6 characters.";
   }
-  if (form.password !== form.confirm) {
+  if (false) {
     return "Passwords do not match.";
   }
killedBy: validateRegister retorna error si passwords no coinciden
statusReason: expected '' to be 'Passwords do not match.' // Object.is equality

[Killed] ConditionalExpression
utils/validators.ts:33:7
   if (form.password.length < 6) {
     return "Password must be at least 6 characters.";
   }
-  if (form.password !== form.confirm) {
+  if (true) {
     return "Passwords do not match.";
   }
killedBy: validateRegister retorna error si terms no está aceptado
statusReason: expected 'Passwords do not match.' to be 'You must accept the terms.' // Object.is equality

[Killed] BlockStatement
utils/validators.ts:36:20
   if (form.password !== form.confirm) {
     return "Passwords do not match.";
   }
-  if (!form.terms) {
-    return "You must accept the terms.";
-  }
+  if (!form.terms) {}
   return "";
 }
killedBy: validateRegister retorna error si terms no está aceptado
statusReason: expected '' to be 'You must accept the terms.' // Object.is equality

[Killed] BooleanLiteral
utils/validators.ts:36:7
   if (form.password !== form.confirm) {
     return "Passwords do not match.";
   }
-  if (!form.terms) {
+  if (form.terms) {
     return "You must accept the terms.";
   }
killedBy: validateRegister retorna error si terms no está aceptado
statusReason: expected '' to be 'You must accept the terms.' // Object.is equality

[Killed] StringLiteral
utils/validators.ts:37:12
     return "Passwords do not match.";
   }
   if (!form.terms) {
-    return "You must accept the terms.";
+    return "";
   }
   return "";
killedBy: validateRegister retorna error si terms no está aceptado
statusReason: expected '' to be 'You must accept the terms.' // Object.is equality

[Killed] BlockStatement
utils/validators.ts:42:56
   return "";
 }
 
-export function validateLogin(form: LoginData): string {
-  if (!form.email || !form.password) {
-    return "Please fill in all fields.";
-  }
-  if (!/^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}$/.test(form.email)) {
-    return "Invalid email address.";
-  }
-  return "";
-}
+export function validateLogin(form: LoginData): string {}
 
 
killedBy: validateLogin retorna error si email está vacío
statusReason: expected undefined to be 'Please fill in all fields.' // Object.is equality

[Killed] ConditionalExpression
utils/validators.ts:43:7
 }
 
 export function validateLogin(form: LoginData): string {
-  if (!form.email || !form.password) {
+  if (false) {
     return "Please fill in all fields.";
   }
killedBy: validateLogin retorna error si email está vacío
statusReason: expected 'Invalid email address.' to be 'Please fill in all fields.' // Object.is equality

[Killed] BooleanLiteral
utils/validators.ts:43:7
 }
 
 export function validateLogin(form: LoginData): string {
-  if (!form.email || !form.password) {
+  if (form.email || !form.password) {
     return "Please fill in all fields.";
   }
killedBy: validateLogin retorna error si email está vacío
statusReason: expected 'Invalid email address.' to be 'Please fill in all fields.' // Object.is equality

[Killed] BooleanLiteral
utils/validators.ts:46:7
   if (!form.email || !form.password) {
     return "Please fill in all fields.";
   }
-  if (!/^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}$/.test(form.email)) {
+  if (/^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}$/.test(form.email)) {
     return "Invalid email address.";
   }
killedBy: validateLogin retorna error si email es inválido
statusReason: expected '' to be 'Invalid email address.' // Object.is equality

[Killed] ConditionalExpression
utils/validators.ts:46:7
   if (!form.email || !form.password) {
     return "Please fill in all fields.";
   }
-  if (!/^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}$/.test(form.email)) {
+  if (false) {
     return "Invalid email address.";
   }
killedBy: validateLogin retorna error si email es inválido
statusReason: expected '' to be 'Invalid email address.' // Object.is equality

[Killed] BlockStatement
utils/validators.ts:54:63
 
 
 
-export function getPasswordStrength(password: string): number {
-  if (password.length === 0) return 0;
-  if (password.length < 6) return 1;
-
-  const hasUppercase = /[A-Z]/.test(password);
-  const hasNumber = /[0-9]/.test(password);
-
-  if (hasUppercase && hasNumber) return 4;
-  if (password.length >= 10) return 3;
-
-  return 2;
-}
+export function getPasswordStrength(password: string): number {}
killedBy: getPasswordStrength retorna 0 si password está vacío
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ConditionalExpression
utils/validators.ts:55:7
 
 
 export function getPasswordStrength(password: string): number {
-  if (password.length === 0) return 0;
+  if (true) return 0;
   if (password.length < 6) return 1;
 
killedBy: getPasswordStrength retorna 1 si password tiene menos de 6 caracteres
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
utils/validators.ts:55:7
 
 
 export function getPasswordStrength(password: string): number {
-  if (password.length === 0) return 0;
+  if (password.length !== 0) return 0;
   if (password.length < 6) return 1;
 
killedBy: getPasswordStrength retorna 0 si password está vacío
statusReason: expected 1 to be +0 // Object.is equality

[Killed] EqualityOperator
utils/validators.ts:56:7
 
 export function getPasswordStrength(password: string): number {
   if (password.length === 0) return 0;
-  if (password.length < 6) return 1;
+  if (password.length >= 6) return 1;
 
   const hasUppercase = /[A-Z]/.test(password);
killedBy: getPasswordStrength retorna 1 si password tiene menos de 6 caracteres
statusReason: expected 2 to be 1 // Object.is equality

[Killed] EqualityOperator
utils/validators.ts:56:7
 
 export function getPasswordStrength(password: string): number {
   if (password.length === 0) return 0;
-  if (password.length < 6) return 1;
+  if (password.length <= 6) return 1;
 
   const hasUppercase = /[A-Z]/.test(password);
killedBy: getPasswordStrength retorna 2 si password tiene entre 6 y 9 caracteres
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
utils/validators.ts:61:7
   const hasUppercase = /[A-Z]/.test(password);
   const hasNumber = /[0-9]/.test(password);
 
-  if (hasUppercase && hasNumber) return 4;
+  if (false) return 4;
   if (password.length >= 10) return 3;
 
killedBy: getPasswordStrength retorna 4 si password tiene mayúscula y número
statusReason: expected 2 to be 4 // Object.is equality

[Killed] ConditionalExpression
utils/validators.ts:61:7
   const hasUppercase = /[A-Z]/.test(password);
   const hasNumber = /[0-9]/.test(password);
 
-  if (hasUppercase && hasNumber) return 4;
+  if (true) return 4;
   if (password.length >= 10) return 3;
 
killedBy: getPasswordStrength retorna 2 si password tiene entre 6 y 9 caracteres
statusReason: expected 4 to be 2 // Object.is equality

[Killed] ConditionalExpression
utils/validators.ts:62:7
   const hasNumber = /[0-9]/.test(password);
 
   if (hasUppercase && hasNumber) return 4;
-  if (password.length >= 10) return 3;
+  if (false) return 3;
 
   return 2;
killedBy: getPasswordStrength retorna 3 si password es largo pero sin mayúscula ni número
statusReason: expected 2 to be 3 // Object.is equality

[Killed] EqualityOperator
utils/validators.ts:62:7
   const hasNumber = /[0-9]/.test(password);
 
   if (hasUppercase && hasNumber) return 4;
-  if (password.length >= 10) return 3;
+  if (password.length < 10) return 3;
 
   return 2;
killedBy: getPasswordStrength retorna 2 si password tiene entre 6 y 9 caracteres
statusReason: expected 3 to be 2 // Object.is equality
