[Killed] BlockStatement
utils/validators.ts:16:62
   password: string;
 }
 
-export function validateRegister(form: RegisterData): string {
-  if (
-  !form.firstName ||
-  !form.lastName ||
-  !form.email ||
-  !form.password ||
-  !form.confirm
-) {
-  return "Fill in all required fields.";
-}
-  if (!/^[^\s@]+@[^\s@]+\.[^\s@]+$/.test(form.email)) {
-    return "Invalid email address.";
-  }
-  if (form.password.length < 6) {
-    return "Password must be at least 6 characters.";
-  }
-  if (form.password !== form.confirm) {
-    return "Passwords do not match.";
-  }
-  if (!form.terms) {
-    return "You must accept the terms.";
-  }
-  return "";
-}
+export function validateRegister(form: RegisterData): string {}
 
 export function validateLogin(form: LoginData): string {
killedBy: validateRegister retorna error si firstName está vacío
statusReason: expected undefined to be 'Fill in all required fields.' // Object.is equality

[Killed] ConditionalExpression
utils/validators.ts:26:7
 ) {
   return "Fill in all required fields.";
 }
-  if (!/^[^\s@]+@[^\s@]+\.[^\s@]+$/.test(form.email)) {
+  if (true) {
     return "Invalid email address.";
   }
killedBy: validateRegister retorna error si password tiene menos de 6 caracteres
statusReason: expected 'Invalid email address.' to be 'Password must be at least 6 character…' // Object.is equality

[Killed] BlockStatement
utils/validators.ts:26:55
 ) {
   return "Fill in all required fields.";
 }
-  if (!/^[^\s@]+@[^\s@]+\.[^\s@]+$/.test(form.email)) {
-    return "Invalid email address.";
-  }
+  if (!/^[^\s@]+@[^\s@]+\.[^\s@]+$/.test(form.email)) {}
   if (form.password.length < 6) {
     return "Password must be at least 6 characters.";
killedBy: validateRegister retorna error si email es inválido
statusReason: expected '' to be 'Invalid email address.' // Object.is equality

[Killed] StringLiteral
utils/validators.ts:27:12
   return "Fill in all required fields.";
 }
   if (!/^[^\s@]+@[^\s@]+\.[^\s@]+$/.test(form.email)) {
-    return "Invalid email address.";
+    return "";
   }
   if (form.password.length < 6) {
killedBy: validateRegister retorna error si email es inválido
statusReason: expected '' to be 'Invalid email address.' // Object.is equality

[Killed] ConditionalExpression
utils/validators.ts:29:7
   if (!/^[^\s@]+@[^\s@]+\.[^\s@]+$/.test(form.email)) {
     return "Invalid email address.";
   }
-  if (form.password.length < 6) {
+  if (false) {
     return "Password must be at least 6 characters.";
   }
killedBy: validateRegister retorna error si password tiene menos de 6 caracteres
statusReason: expected '' to be 'Password must be at least 6 character…' // Object.is equality

[Killed] ConditionalExpression
utils/validators.ts:29:7
   if (!/^[^\s@]+@[^\s@]+\.[^\s@]+$/.test(form.email)) {
     return "Invalid email address.";
   }
-  if (form.password.length < 6) {
+  if (true) {
     return "Password must be at least 6 characters.";
   }
killedBy: validateRegister retorna error si passwords no coinciden
statusReason: expected 'Password must be at least 6 character…' to be 'Passwords do not match.' // Object.is equality

[Killed] EqualityOperator
utils/validators.ts:32:7
   if (form.password.length < 6) {
     return "Password must be at least 6 characters.";
   }
-  if (form.password !== form.confirm) {
+  if (form.password === form.confirm) {
     return "Passwords do not match.";
   }
killedBy: validateRegister retorna error si passwords no coinciden
statusReason: expected '' to be 'Passwords do not match.' // Object.is equality

[Killed] ConditionalExpression
utils/validators.ts:35:7
   if (form.password !== form.confirm) {
     return "Passwords do not match.";
   }
-  if (!form.terms) {
+  if (false) {
     return "You must accept the terms.";
   }
killedBy: validateRegister retorna error si terms no está aceptado
statusReason: expected '' to be 'You must accept the terms.' // Object.is equality

[Killed] BlockStatement
utils/validators.ts:41:56
   return "";
 }
 
-export function validateLogin(form: LoginData): string {
-  if (!form.email || !form.password) {
-    return "Please fill in all fields.";
-  }
-  if (!/^[^\s@]+@[^\s@]+\.[^\s@]+$/.test(form.email)) {
-    return "Invalid email address.";
-  }
-  return "";
-}
+export function validateLogin(form: LoginData): string {}
 
 // export function getPasswordStrength(password: string): number {
killedBy: validateLogin retorna error si email está vacío
statusReason: expected undefined to be 'Please fill in all fields.' // Object.is equality

[Killed] ConditionalExpression
utils/validators.ts:42:7
 }
 
 export function validateLogin(form: LoginData): string {
-  if (!form.email || !form.password) {
+  if (true) {
     return "Please fill in all fields.";
   }
killedBy: validateLogin retorna error si email es inválido
statusReason: expected 'Please fill in all fields.' to be 'Invalid email address.' // Object.is equality

[Killed] LogicalOperator
utils/validators.ts:42:7
 }
 
 export function validateLogin(form: LoginData): string {
-  if (!form.email || !form.password) {
+  if (!form.email && !form.password) {
     return "Please fill in all fields.";
   }
killedBy: validateLogin retorna error si email está vacío
statusReason: expected 'Invalid email address.' to be 'Please fill in all fields.' // Object.is equality

[Killed] ConditionalExpression
utils/validators.ts:45:7
   if (!form.email || !form.password) {
     return "Please fill in all fields.";
   }
-  if (!/^[^\s@]+@[^\s@]+\.[^\s@]+$/.test(form.email)) {
+  if (false) {
     return "Invalid email address.";
   }
killedBy: validateLogin retorna error si email es inválido
statusReason: expected '' to be 'Invalid email address.' // Object.is equality

[Killed] ConditionalExpression
utils/validators.ts:61:7
 
 export function getPasswordStrength(password: string): number {
   if (password.length === 0) return 0;
-  if (password.length < 6) return 1;
+  if (false) return 1;
 
   const hasUppercase = /[A-Z]/.test(password);
killedBy: getPasswordStrength retorna 1 si password tiene menos de 6 caracteres
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
utils/validators.ts:61:7
 
 export function getPasswordStrength(password: string): number {
   if (password.length === 0) return 0;
-  if (password.length < 6) return 1;
+  if (true) return 1;
 
   const hasUppercase = /[A-Z]/.test(password);
killedBy: getPasswordStrength retorna 2 si password tiene entre 6 y 9 caracteres
statusReason: expected 1 to be 2 // Object.is equality

[Survived] Regex
utils/validators.ts:63:24
   if (password.length === 0) return 0;
   if (password.length < 6) return 1;
 
-  const hasUppercase = /[A-Z]/.test(password);
+  const hasUppercase = /[^A-Z]/.test(password);
   const hasNumber = /[0-9]/.test(password);
 

[Survived] Regex
utils/validators.ts:64:21
   if (password.length < 6) return 1;
 
   const hasUppercase = /[A-Z]/.test(password);
-  const hasNumber = /[0-9]/.test(password);
+  const hasNumber = /[^0-9]/.test(password);
 
   if (hasUppercase && hasNumber) return 4;

[Killed] ConditionalExpression
utils/validators.ts:67:7
   const hasNumber = /[0-9]/.test(password);
 
   if (hasUppercase && hasNumber) return 4;
-  if (password.length >= 10) return 3;
+  if (true) return 3;
 
   return 2;
killedBy: getPasswordStrength retorna 2 si password tiene entre 6 y 9 caracteres
statusReason: expected 3 to be 2 // Object.is equality
